УправлениеИТФирмой_First/src/DataProcessors/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УстановкаЦен</name>
</mdclass:DataProcessor>

УправлениеИТФирмой_First/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеИТФирмой_First/src/DataProcessors/УстановкаЦен/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВариантУстановкиПриИзменении(Элемент)
	
	ВыбранныйЭлементУстановки = Элементы.ВариантУстановки.СписокВыбора;
	
	Если ВариантУстановки = 0 Тогда
		
		Элементы.ФиксированнаяЦена.Доступность = Истина;
		Элементы.ПроцентОтТекущей.Доступность = Ложь;
		
	ИначеЕсли ВариантУстановки = 1 Тогда
		
		Элементы.ФиксированнаяЦена.Доступность = Ложь;
		Элементы.ПроцентОтТекущей.Доступность = Истина;
		
	ИначеЕсли ВариантУстановки = 2 Тогда
		
		Элементы.ФиксированнаяЦена.Доступность = Ложь;
		Элементы.ПроцентОтТекущей.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНаСервере()
	
	//Менеджер = РегистрыСведений.Цены;
	//Отбор = Новый Структура; 
	//Отбор.Вставить("Номенклатура", Номенклатура);
	//Данные = Менеджер.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	
	МассивНоменклатуры = МассивНоменклатурыДляУстановки();

	Если ВариантУстановки = 0 Тогда
		//ФиксированнаяЦена
		УстановитьФиксированнуюЦену(МассивНоменклатуры, ФиксированнаяЦена);
		
	ИначеЕсли ВариантУстановки = 1 Тогда
		//Процент
		УстановитьЦенуПоПроцентуОтТекущейЦены(МассивНоменклатуры, ПроцентОтТекущей);
		
	ИначеЕсли ВариантУстановки = 2 Тогда
		//Удаление цен
		УдалитьЦены(МассивНоменклатуры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция МассивНоменклатурыДляУстановки()
		
	МассивНоменклатуры = Новый Массив;
	
	Для Каждого Строчка Из Номенклатура Цикл
		
		ВыбраннаяНоменклатура = Строчка.Номенклатура;
		
		ДобавитьНоменклатуруВМассив(МассивНоменклатуры, ВыбраннаяНоменклатура);
		
	КонецЦикла;
	
	Возврат МассивНоменклатуры;

КонецФункции

&НаСервере
Процедура ДобавитьНоменклатуруВМассив(МассивНоменклатуры, ВыбраннаяНоменклатура)
	
	Если ВыбраннаяНоменклатура.ЭтоГруппа Тогда 
		
		Выборка = Справочники.Номенклатура.Выбрать(ВыбраннаяНоменклатура); 
		
		Пока Выборка.Следующий() Цикл
			
			ДобавитьНоменклатуруВМассив(МассивНоменклатуры, Выборка.Ссылка)
			
		КонецЦикла; 
		
	Иначе
		
		МассивНоменклатуры.Добавить(ВыбраннаяНоменклатура);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УдалитьЦены(МассивНоменклатуры)
	
	Для Каждого ЭлементНоменклатуры Из МассивНоменклатуры Цикл
		
		НаборЗаписей = РегистрыСведений.Цены.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(ЭлементНоменклатуры);
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦенуПоПроцентуОтТекущейЦены(МассивНоменклатуры, Процент)
			
	Для Каждого ЭлементНоменклатуры Из МассивНоменклатуры Цикл 
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", ЭлементНоменклатуры);
		
		СтараяЦена = РегистрыСведений.Цены.ПолучитьПоследнее(, Отбор).Цена;
		
		
		Запись = РегистрыСведений.Цены.СоздатьМенеджерЗаписи();
		
		Запись.Номенклатура = ЭлементНоменклатуры;
		Запись.Период = ТекущаяДата();
		Запись.Цена = СтараяЦена + СтараяЦена*Процент/100;
		Запись.Установил = ПараметрыСеанса.СотрудникТекущегоПользователя;
		
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФиксированнуюЦену(МассивНоменклатуры, Цена)
	
	Для Каждого ЭлементНоменклатуры Из МассивНоменклатуры Цикл
		
	Запись = РегистрыСведений.Цены.СоздатьМенеджерЗаписи();
	
	Запись.Номенклатура = ЭлементНоменклатуры;
	Запись.Период = ТекущаяДата();
	Запись.Цена = Цена;
	Запись.Установил = ПараметрыСеанса.СотрудникТекущегоПользователя;
	
	Запись.Записать();
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	УстановитьНаСервере();
КонецПроцедуры
